# Books (Core)

Rodrigo Arguello-Serrano

## Insert Books ERD

![png](Data/books_ERD.png)

## Import Modules

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
# ## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/books"
engine = create_engine(connection)

## Check MySQL Connection

In [2]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [3]:
df_users = pd.read_csv('Data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [4]:
df_authors = pd.read_csv('Data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [5]:
df_books = pd.read_csv('Data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [6]:
df_fav = pd.read_csv('Data/favorites.csv')
df_fav.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

## Making a data frame a table in a MySQL database

In [7]:
df_authors.to_sql('authors', con=engine, if_exists='replace', index=False)

5

In [8]:
df_books.to_sql('books', con=engine, if_exists='replace', index=False)

6

In [9]:
df_fav.to_sql('favorites', con=engine, if_exists='replace', index=False)

7

In [10]:
df_users.to_sql('users', con=engine, if_exists='replace', index=False)

3

## Testing the Database

In [13]:
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
'''
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

## Exporting Database

> Database exported as books.sql